base/DataProcessors/бит_НастройкаПравДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_НастройкаПравДоступа</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СубъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныПравДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныПравДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеОтключено</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Шаблоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныПравДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

base/DataProcessors/бит_НастройкаПравДоступа/Forms/ФормаЗаполненияПоШаблону/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ.

#Область ПроцедурыОбработчикиСобытийЭлементовФормы



&НаКлиенте
Процедура ШаблоныШаблонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Шаблоны.ТекущиеДанные;
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект
	                                                   ,Элемент
	                                                   ,ТекущаяСтрока
	                                                   ,"Шаблон"
													   ,фКэшЗначений.СписокТиповШаблон
													   ,СтандартнаяОбработка);
													   
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныШаблонОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.ШаблоныШаблон.ВыбиратьТип = Истина;
	
КонецПроцедуры


#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ДЕЙСТВИЯ КОМАНД ФОРМЫ

#Область ДействияКомандФормы



&НаКлиенте
Процедура КомандаОК(Команда)
	
	РезСтр = Новый Структура;
	Шаблоны = Новый Массив;
	Для каждого ТекСтрока Из Объект.Шаблоны Цикл
	
		Шаблоны.Добавить(ТекСтрока.Шаблон);
	
	КонецЦикла; 
	
	РезСтр.Вставить("Шаблоны", Шаблоны);
	
	Закрыть(РезСтр);
	
КонецПроцедуры


#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ НА СЕРВЕРЕ.

#Область ПроцедурыОбработчикиСобытийФормыНаСервере



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Шаблоны") Тогда
	
		Для каждого ТекШаблон Из Параметры.Шаблоны Цикл
		
			НоваяСтрока = Объект.Шаблоны.Добавить();
			НоваяСтрока.Шаблон = ТекШаблон;
		
		КонецЦикла; 
	
	КонецЕсли; 
	
	фКэшЗначений = Новый Структура;
	
	// Заполним список типов для быстрого выбора составного.
	МассивТипов  = Метаданные.Обработки.бит_НастройкаПравДоступа.ТабличныеЧасти.Шаблоны.Реквизиты.Шаблон.Тип.Типы();
	СписокВыбора = бит_ОбщегоНазначения.ПодготовитьСписокВыбораТипа(МассивТипов);
	фКэшЗначений.Вставить("СписокТиповШаблон", СписокВыбора);
	
КонецПроцедуры
#КонецОбласти
